[
  {
    "title": "This Website",
    "description": "I wanted to take my first steps into modern web development and give my personal website a redo as it had been a while since its last update. This website uses Vue and Tailwind CSS (yes, these are overkill but I learned).",
    "date": "Summer 2025",
    "imageUrl": "https://henrysilva.xyz/assets/images/website2.png",
    "skills": [
      "Vue",
      "Tailwind CSS",
      "JavaScript"
    ],
    "links": [
      "https://henrysivla.xyz",
      "https://github.com/henrySi1va/personal-website"
    ]
  },
  {
    "title": "Custom LED Controller",
    "description": "I had always wanted cool LEDs in my room, but the controllers you can buy did not have enough customization. I made a controller based on the ESP32 along with a companion Android app. The app supports a variety of patterns to customize. My favorites where soft color transitions and rolling red, white, and blue for the 4th of July.",
    "date": "Summer 2020",
    "imageUrl": "https://henrysilva.xyz/assets/images/led.gif",
    "skills": [
      "C++",
      "FreeRTOS",
      "Android Development",
      "Bluetooth",
      "Circuit Design",
      "Soldering"
    ],
    "links": [
      "https://github.com/Lazloian/LEDControllerV2"
    ]
  },
  {
    "title": "STM32 Tutorial",
    "description": "The robotics team I joined my freshman year of college used the STM32 microcontroller almost exclusively. I created a tutorial for setting up and using PWM on the STM32 using the STM32CubeIDE. I got a better grasp of configuring the STM32 and it gave others on my team a place to start when beginning a new project.",
    "date": "Summer 2020",
    "imageUrl": "https://henrysilva.xyz/assets/images/tutorial.png",
    "skills": [
      "STM32",
      "Embedded C",
      "Technical Writing"
    ],
    "links": [
      "https://github.com/Lazloian/STM32Tutorial/tree/master/PWMandServo"
    ]
  },
  {
    "title": "Static Site Generator",
    "description": "When making my first website as an ignorant teenager, I had the genius and original idea of translating markdown files into html so I could easily add content to the website (I had never heard of a static site generator before). The tool can upload content to the server, list/remove posts, and update the site. I was very proud of it until I found hugo a few years later.",
    "date": "Summer 2020",
    "imageUrl": "https://henrysilva.xyz/assets/images/website.png",
    "skills": [
      "Linux",
      "Shell Scripting",
      "HTML"
    ],
    "links": [
      "https://github.com/Lazloian/henrysilva.xyz"
    ]
  },
  {
    "title": "Robot Driver HUD and Ammo Detector",
    "description": "I was on a robotics team that did not allow customization of the driver's UI on the computer so we made a workaround by creating a custom HUD on a transparent LED screen in front of the robot's camera. The HUD showed warnings for low ammo and blind spot detection using time of flight sensors. I made a custom controller board and ammo detector that integrated into the robot's ammo hopper.",
    "date": "Fall 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/test.gif",
    "skills": [
      "PCB Design",
      "Embedded C"
    ],
    "links": [
      "https://github.com/PurdueRM/Electrical-System/tree/master/Heads-Up-Display-ToF"
    ]
  },
  {
    "title": "Dog Sleep Tracker",
    "description": "I wanted to know how much my dog slept in a day. I used an ESP32 with an accelerometer to track movement and a raspberry pi running Node-RED and Grafana to visualize the data. A custom circuit board and 3D printed case made it possible to attach to my dog's collar. It turned out to be a bit too heavy for her so I never got to learn how much she slept.",
    "date": "Summer 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/dogpcb.JPG",
    "skills": [
      "ESP32",
      "C++",
      "Raspberry Pi",
      "Node-RED",
      "CAD",
      "3D Printing"
    ],
    "links": [
      "https://github.com/Lazloian/DogWifi"
    ]
  },
  {
    "title": "Robotics Curriculum",
    "description": "My high school's summer robotics class desperately needed an upgrade. The class was targeted for boys in junior high so I made team based competition a core part of the curriculum. Each week started with interactive lessons and culminated in a tournament featuring a game which applied the skills learned that week. The class used the Lego Mindstorms platform. The entire course was documented so that the class could be handed off to a new teacher the following summer.",
    "date": "Summer 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/lego.png",
    "skills": [
      "Effective Communication",
      "Teaching",
      "Game Design",
      "Powerpoint"
    ],
    "links": [
    ]
  },
  {
    "title": "Simple Video Game: Project Isaac",
    "description": "I got my start into programming making video games when I was in 5th grade, but those early projects have been lost to time (probably for the better). This project is inspired by the hit game The Binding of Isaac. It features random map generation, a couple enemy types, and a boss fight. It is written in Java. For some reason, I saved the executable in the repo, so I got it running recently and it still works!",
    "date": "Spring 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/isaac.png",
    "skills": [
      "Java",
      "Game Design",
      "Procedural Generation"
    ],
    "links": [
      "https://github.com/Lazloian/ProjectIsaac"
    ]
  },
  {
    "title": "Game Utility: Auto Background Changer",
    "description": "Back in highschool, I was a fan of the rhythm game osu!. However, I was very much not a fan of the anime themed backgrounds used by the songs in the game. I figured out how to change the backgrounds in the game files, but I changed them so frequently that I made a tool to do it for me.",
    "date": "Spring 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/osu_cancel.png",
    "skills": [
      "C#",
      "Windows Forms",
      "Windows Utilities"
    ],
    "links": [
      "https://github.com/Lazloian/OsuBackgroundChanger"
    ]
  },
  {
    "title": "Team Sign-In App",
    "description": "My high school robotics team needed to track student attendance to determine if members met the requirements to go with the team for competitions. I made a simple Windows form that allowed students to sign in using their student ID. The app would track attendance and output a report upon request. It kind of worked, but it ran into some bugs and the coach decided to use pen and paper.",
    "date": "Fall 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/sign-in.png",
    "skills": [
      "C#",
      "Windows Forms",
      "Windows Utilities"
    ],
    "links": [
      "https://github.com/Lazloian/SignIn"
    ]
  },
  {
    "title": "Economics Game: Widgets",
    "description": "My AP Macroeconomics class had an open-ended final project and I decided to make a video game. You play as a firm making widgets in a competitive market. You must manage the output of your factories, hire labor, and adjust the price of your widgets. You may also use various illegal business practices to get an edge over your competition. The game was played in class and I got a good grade.",
    "date": "Fall 2019",
    "imageUrl": "https://henrysilva.xyz/assets/images/econ.png",
    "skills": [
      "Java",
      "Macroeconomics",
      "Game Design"
    ],
    "links": [
      "https://github.com/Lazloian/EconGame"
    ]
  }
]